Oi Miriam, dei uma olhada no site e consigo passar alguns pontos para melhoras.
* HTML & CSS

** TODO Criar classes para atributos como ul e li dentro da nav
  - Exemplo:
    #+BEGIN_SRC html
    <ul class="nav-itens">
      <li class="nav-item">
    #+END_SRC

  Porque quando for estilizar você não precisa ficar usando nav > ul >
  li, apenas pode usar as classes que foram definidas.
  (também pode usar [[http://getbem.com/introduction/][BEM]] para escrever as classes)
* HTML
  1- No Head sempre use o [[https://www.w3schools.com/css/css_rwd_viewport.asp][viewport de responsividade]]
  2- Em vez de usar '< div class="content" > use < section>' (https://www.w3schools.com/tags/tag_section.asp)
  3- Em vez de usar Imagens via CDN, baixe a imagem, coloque dentro de uma pasta img e chame ela no html.

* CSS

  1 - Em vez de usar nome de cores, procure usar Hexadecimais, ex: #000 = black;

* Tarefas
** DONE Colocar viewport de responsividade no <head>
   CLOCK: [2018-04-12 Qui 10:02]--[2018-04-12 Qui 10:07] =>  0:05
** DONE Trocar <div class="content"> por <section>
   CLOCK: [2018-04-12 Qui 10:07]--[2018-04-12 Qui 10:09] =>  0:02
** DONE Colocar imagens em um diretório chamado img
   CLOCK: [2018-04-12 Qui 10:09]--[2018-04-12 Qui 10:14] =>  0:05
** DONE Referenciar imagens de dentro do diretório img
** DONE Trocar cores do CSS por hexadecimais
   CLOCK: [2018-04-12 Qui 10:15]--[2018-04-12 Qui 10:19] =>  0:04
** DONE Colocar classes para ul e li dentro da nav
   CLOCK: [2018-04-12 Qui 10:19]--[2018-04-12 Qui 10:20] =>  0:01
** DONE Arrumar organização dos itens da navbar para mobile (classe na media query)
   CLOCK: [2018-04-12 Qui 10:46]--[2018-04-12 Qui 11:11] =>  0:25
** DONE Aplicar BEM ao projeto
   CLOCK: [2018-04-12 Qui 11:20]--[2018-04-12 Qui 11:20] =>  0:00
